#include<stdio.h>


//数组的创建
//int main() {
//
//	////int a=1;
//	////int b=2;
//	////int c=3;
//	////1-10
//	////数组-一组相同类型元素的集合
//	////int arr[10];
//	//// 如果按照上面这样写的话，没有赋值，会出现随机值
//	//// 所以
//	//int arr[10] = {1,2,3,4,5,6,7,8,9,10};
//	////可以随便放，但是不能超过10个
//	////放了10个元素每个元素都是一个整形
//	//对于整型初始化来说上面是对的
//
//
//	////想存字符
//	////char ch[5];
//	//char ch[5];
//	//char arr1[] = ('b', 'i', 't');
//	//char arr2[] = ("bit");
//	////上面是字符串 char的初始化
//
//
//
//
//	//int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	//             // 0 1 2 3 4 5 6 7 8 9
//	/*printf("%d\n", arr[5]);*/
//	//每个数字都会有下标
//	//arr[5]其实对应是的6
//
//
//	int arr[10] = { 0 };//首先创建一个数组，全部都是0
//	int i = 0;
//
//	while (i < 10)
//	scanf("%d\n", &arr[i]);
//	i++;
//
//	i = 10;
//	while (i < 10)
//		printf("%d\n", arr[i]);
//	i++;
//
//
//	return 0;
//}















//int main() {
////	int a = 21;
////	int b = 4;
////	printf("%d\n", a / b);
////	printf("%d\n", a % b);
//////  /除法得到的商
////	// % 取模-得到的是余数
//	// % 这个操作符只能作用于整数，
////下面这个float类型不可以用
//
//
//	//float a = 10.0f;
//	// 如果上面不加f，那么就是一个double值赋给float
//	//会出现报错 8个赋给4个会报错
//	
//	//float b = 3.0f;
//	//printf("f\n", a / b);
//
//	//float c = 10/ 3;
//	//printf("%f\n", c);
//	//这样写的话，打印结果是3.0000
//	
//	//但是我如果想打印后面小数的话
//	//按照下面
//	//   /除法操作符的两端如果都是整数，执行的是整数除法
//	// 只要有一个操作数是浮点数，执行的就是浮点型除法
//	float c = 10.0f / 3;
//	printf("%f\n", c);
//
//	return 0;
//}












//int main() {
//	//int flag = 3;
//	//c语言中，0表示假，非0表示真
//	//flag为真打印hehe
//	//int flag = 0;
//	int flag = 3;//此时变成真
//	//那么有感叹号的变成假，没有感叹号的是真
//	//3为真，会打印没有感叹号的
//	if (flag) {
//		printf("hehe\n");
//	}
//	if (!flag) {
//		printf("haha\n");
//	}
//	return 0;
//	//上述代码，flag为0，则表示假
//	//但是这两行代码都表示真，打印不出来
//	// 可以加！号，可以把真变成假，也可以把假改成真
//
//}









//
//int main() {
//	int a = -10;
//	a = -a;
//	printf("%d\n", a);
//	return 0;
//	// - 负值， 根据上面 负负得正。
//}






//int main() {
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(arr));//这是总的字节，40个
//	printf("%d\n", sizeof(arr[0]));
//	//打印结果为4，
//	//因为int类型为4个字节，所以是4
//
//
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	//这一步就是40/10
//	printf("%d\n", sz);
//	return 0;
//}






int main() {
	////这是后置--
	//int a = 10;
	//	int b = a--;//后置--  先使用,在--
	//	// int b=a,a=a-1;
	//	printf("a=%d,b=%d\n", a, b);// 打印为9，10
	//	//因为 先使用，已经把a=10 先用，赋值给了b，b=10
	//	//然后在 -- ，10-1=9.a=9，b=10.
	//	return 0;





	//int a = 10;
	//int b = --a;
	////a=a-1.int b=a
	//printf("a=%d,b=%d\n", a, b);


	//int a = 10;
	//int b = a++;
	//printf("a=%d,b=%d\n", a, b);




	



	// 强制转换类型
	//
	//int a = (int)3.14;
	////int 整数， 3.14小数点
	//float c= (float)3.14;

	////加上一个括号就能强制转换
	//return 0;


	//逻辑与--并且
	// 都要一起才可以，比如下面的比较大小
	//int age = 21;
	//if (age <= 30 && age >= 18);
	//要这样写




	//逻辑或-或者
	char ch = 'Q';
	if (ch < 'a' || ch>'z');

	return 0;



}








